# Roubos de celular na cidade de São Paulo

Nesse notebook, vamos filtrar e tratar os dados de roubos de celulares ocorridos na cidade de São Paulo, utilizando Jupyter e GeoPandas

In [1]:
# Importando a biblioteca Pandas para leitura dos dados
import pandas as pd

In [4]:
# Lendo os dados
filename = 'data/dados_roubo_celular_sp_2024.xlsx'

df_roubos = pd.read_excel(filename)

In [5]:
df_roubos.head()

,ID_DELEGACIA,NOME_DEPARTAMENTO,NOME_SECCIONAL,NOME_DELEGACIA,NOME_MUNICIPIO,ANO_BO,NUM_BO,VERSAO,NOME_DEPARTAMENTO_CIRC,NOME_SECCIONAL_CIRC,...,DESCR_MODO_OBJETO,DESCR_TIPO_OBJETO,DESCR_SUBTIPO_OBJETO,DESCR_UNIDADE,QUANTIDADE_OBJETO,MARCA_OBJETO,FLAG_BLOQUEIO,FLAG_DESBLOQUEIO,MES,ANO
0,10109,DECAP,DEL.SEC.1º CENTRO,01ª DDM CENTRO,S.PAULO,2024,AL6931,1,DECAP,DEL.SEC.1º CENTRO,...,Subtraído,Telecomunicação,Telefone Celular,Unidade,1,Samsung,N,N,1,2024
1,10109,DECAP,DEL.SEC.1º CENTRO,01ª DDM CENTRO,S.PAULO,2024,AL6931,1,DECAP,DEL.SEC.1º CENTRO,...,Subtraído,Telecomunicação,Telefone Celular,Unidade,1,Samsung,N,N,1,2024
2,10109,DECAP,DEL.SEC.1º CENTRO,01ª DDM CENTRO,S.PAULO,2024,AN9687,1,DECAP,DEL.SEC.1º CENTRO,...,Subtraído,Telecomunicação,Telefone Celular,Unidade,1,Outros,S,N,1,2024
3,10109,DECAP,DEL.SEC.1º CENTRO,01ª DDM CENTRO,S.PAULO,2024,AH3601,2,DECAP,DEL.SEC.7º ITAQUERA,...,Subtraído,Telecomunicação,Telefone Celular,Unidade,1,Samsung,N,N,1,2024
4,10109,DECAP,DEL.SEC.1º CENTRO,01ª DDM CENTRO,S.PAULO,2024,AH3601,2,DECAP,DEL.SEC.7º ITAQUERA,...,Subtraído,Telecomunicação,Telefone Celular,Unidade,1,Samsung,N,N,1,2024

In [6]:
# Mostrar todas as colunas para verificar se temos informações de latitude e longitude
df_roubos.columns

Index(['ID_DELEGACIA', 'NOME_DEPARTAMENTO', 'NOME_SECCIONAL', 'NOME_DELEGACIA',
       'NOME_MUNICIPIO', 'ANO_BO', 'NUM_BO', 'VERSAO',
       'NOME_DEPARTAMENTO_CIRC', 'NOME_SECCIONAL_CIRC', 'NOME_DELEGACIA_CIRC',
       'NOME_MUNICIPIO_CIRC', 'DATA_OCORRENCIA_BO', 'HORA_OCORRENCIA',
       'DESCRICAO_APRESENTACAO', 'DATAHORA_REGISTRO_BO', 'DATA_COMUNICACAO_BO',
       'DATAHORA_IMPRESSAO_BO', 'DESCR_PERIODO', 'AUTORIA_BO',
       'FLAG_INTOLERANCIA', 'TIPO_INTOLERANCIA', 'FLAG_FLAGRANTE',
       'FLAG_STATUS', 'DESC_LEI', 'FLAG_ATO_INFRACIONAL', 'RUBRICA',
       'DESCR_CONDUTA', 'DESDOBRAMENTO', 'CIRCUNSTANCIA', 'DESCR_TIPOLOCAL',
       'DESCR_SUBTIPOLOCAL', 'CIDADE', 'BAIRRO', 'CEP', 'LOGRADOURO_VERSAO',
       'LOGRADOURO', 'NUMERO_LOGRADOURO', 'LATITUDE', 'LONGITUDE',
       'CONT_OBJETO', 'DESCR_MODO_OBJETO', 'DESCR_TIPO_OBJETO',
       'DESCR_SUBTIPO_OBJETO', 'DESCR_UNIDADE', 'QUANTIDADE_OBJETO',
       'MARCA_OBJETO', 'FLAG_BLOQUEIO', 'FLAG_DESBLOQUEIO', 'MES', 'ANO'],
      dtype='object')

In [7]:
# Mostrar apenas os dados de latitude e longitude
df_roubos[['LATITUDE', 'LONGITUDE']]

         LATITUDE  LONGITUDE
0        0.000000   0.000000
1        0.000000   0.000000
2      -23.528590 -46.606265
3        0.000000   0.000000
4        0.000000   0.000000
...           ...        ...
111022 -23.488858 -46.375312
111023 -23.488858 -46.375312
111024 -23.488858 -46.375312
111025 -23.488858 -46.375312
111026 -23.488858 -46.375312

[111027 rows x 2 columns]

In [8]:
# Removendo valores zerados ou NaN
df_roubos = df_roubos.dropna(subset=['LATITUDE', 'LONGITUDE'])
df_roubos[['LATITUDE', 'LONGITUDE']]

         LATITUDE  LONGITUDE
0        0.000000   0.000000
1        0.000000   0.000000
2      -23.528590 -46.606265
3        0.000000   0.000000
4        0.000000   0.000000
...           ...        ...
111022 -23.488858 -46.375312
111023 -23.488858 -46.375312
111024 -23.488858 -46.375312
111025 -23.488858 -46.375312
111026 -23.488858 -46.375312

[95585 rows x 2 columns]